#include <iostream>
using namespace std;

int main()
{
    //CONTOH 1
    system("chcp 65001 >nul");
    cout << "\033[93m"; // kuning
    cout << "🌼⋆｡ﾟ☁｡⋆｡  PERPUSKITA  ｡⋆｡☁ﾟ｡⋆🌼\n";
    cout << "      Sistem Informasi Perpustakaan\n";
    cout << "🌼⋆｡ﾟ☁｡⋆｡───────────────｡⋆｡☁ﾟ｡⋆🌼\n\n";
    cout << "\033[0m";
    cout << "Masukkan Username\n";
    cout << "➤ : ";
    
    //CONTOH 2
    cout << "\033[36m"; 
    cout << "CONTOH 2\n";
    cout << R"(    _ __                    _ __                    _        _      _             
  | '_ \   ___      _ _   | '_ \  _  _     ___    | |__    (_)    | |_    __ _   
  | .__/  / -_)    | '_|  | .__/ | +| |   (_-<    | / /    | |    |  _|  / _` |  
  |_|__   \___|   _|_|_   |_|__   \_,_|   /__/_   |_\_\   _|_|_   _\__|  \__,_|  
_|"""""|_|"""""|_|"""""|_|"""""|_|"""""|_|"""""|_|"""""|_|"""""|_|"""""|_|"""""| 
"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'"`-0-0-'  )";
    cout << "\033[0m\n\n\n";
    return 0;
}
